task_manager/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."authentication_token" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def current_user
        @current_user = User.find_by(authentication_token: request.headers['Authorization'])