task_manager/app/controllers/password_reset_controller.rb

    def new
      user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "example8@gmail.com"], ["LIMIT", 1]]

    def create
      user = User.find_by(email: params[:email])
      token = user.password_reset_token

        if token == params[:password_reset_token]
          user.update(password: params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jeffgichuki68@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2023-03-30 13:14:04.800920"], ["id", 2]]