task_manager/app/controllers/projects_controller.rb

  def show
    if current_user
      projects = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]

  def create
    project = current_user.projects.new(project_params)
    if project.save
---
INSERT INTO "projects" ("name", "description", "due_date", "user_id", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    current_project = current_user.projects.find(params[:id])
    if current_project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 10], ["id", 5], ["LIMIT", 1]]
UPDATE "projects" SET "name" = ?, "description" = ?, "due_date" = ?, "completed" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Updated Project Name"], ["description", "This is the updated project description"], ["due_date", "2023-05-01"], ["completed", 1], ["updated_at", "2023-03-29 19:14:36.167386"], ["id", 2]]

  def destroy
    current_project = current_user.projects.find(params[:id])
    current_project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 3]]