task_manager/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 5]]
---
    def index
      tasks = current_user.tasks.all

INSERT INTO "tasks" ("name", "description", "due_date", "completed", "project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      current_task = current_user.tasks.new(task_params)
      current_task.project_id = params[:project_id]
      if current_task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 9], ["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Random task description update"], ["updated_at", "2023-03-29 07:23:36.505363"], ["id", 1]]
---
    def update
      current_task = current_user.tasks.find_by(id: params[:id], project_id: params[:project_id])
      if current_task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 9], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
    def destroy
     current_task = current_user.tasks.find_by(id: params[:id], project_id: params[:project_id])
      if current_task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? AND "tasks"."project_id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["project_id", 2], ["LIMIT", 1]]
---
    def find_project_and_task
      @task = current_user.tasks.find_by(id: params[:id], project_id: params[:project_id])