task_manager/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "password_reset_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      user = User.new(user_params)
      user.password = params[:password]
      user.password_reset_token= SecureRandom.urlsafe_base64
      if user.save

UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Fatuu"], ["email", "fatuuu@new.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-03-29 21:36:52.865285"], ["id", 2]]
---
    def update
      if @user.update(user_params)