task_manager/app/models/project.rb

    def update_dependent_records
      tasks.update_all(project_id: nil)
---
UPDATE "tasks" SET "project_id" = ? WHERE "tasks"."project_id" = ?  [["project_id", nil], ["project_id", 1]]